In [2]:
import pandas as pd

In [3]:
import os

In [4]:
os.getcwd()

'C:\\Users\\KIRTI RAJ PRADHAN'

In [5]:
os.chdir("C:\\Users\\KIRTI RAJ PRADHAN\\Downloads")

In [6]:
df=pd.read_excel("liver_patient.xlsx")

In [7]:
df

,Age,Gender,TB,DB,Alkphos,Sgpt,Sgot,TP,ALB,ALB.1,AG,LiverPatient
0,65,Female,0.7,0.1,187,16,18,6.8,6.8,3.3,0.90,Yes
1,62,Male,10.9,5.5,699,64,100,7.5,7.5,3.2,0.74,Yes
2,62,Male,7.3,4.1,490,60,68,7.0,7.0,3.3,0.89,Yes
3,58,Male,1.0,0.4,182,14,20,6.8,6.8,3.4,NaN,Yes
4,72,NaN,3.9,2.0,195,27,59,7.3,7.3,2.4,0.40,Yes
5,46,Male,1.8,0.7,208,19,14,7.6,7.6,4.4,1.30,Yes
6,26,NaN,0.9,0.2,154,16,12,7.0,7.0,3.5,NaN,Yes
7,29,Female,NaN,0.3,202,14,11,6.7,6.7,3.6,1.10,Yes
8,17,Male,0.9,0.3,202,22,19,7.4,7.4,4.1,1.20,No

In [8]:
df["Age"].sum()

437

In [9]:
df["Age"].mean()

48.55555555555556

In [10]:
df["Age"].median()

58.0

In [11]:
df["Age"].mode()

0    62
Name: Age, dtype: int64

In [12]:
df["Age"].min()

17

In [13]:
df["Age"].max()

72

In [14]:
#range
df["Age"].max()-df["Age"].min()

55

In [15]:
df.describe()

,Age,TB,DB,Alkphos,Sgpt,Sgot,TP,ALB,ALB.1,AG
count,9.000000,8.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,7.000000
mean,48.555556,3.425000,1.511111,279.888889,28.000000,35.666667,7.122222,7.122222,3.466667,0.932857
std,19.887880,3.776147,1.980811,186.536487,19.742087,32.019525,0.334581,0.334581,0.565685,0.304998
min,17.000000,0.700000,0.100000,154.000000,14.000000,11.000000,6.700000,6.700000,2.400000,0.400000
25%,29.000000,0.900000,0.300000,187.000000,16.000000,14.000000,6.800000,6.800000,3.300000,0.815000
50%,58.000000,1.400000,0.400000,202.000000,19.000000,19.000000,7.000000,7.000000,3.400000,0.900000
75%,62.000000,4.750000,2.000000,208.000000,27.000000,59.000000,7.400000,7.400000,3.600000,1.150000
max,72.000000,10.900000,5.500000,699.000000,64.000000,100.000000,7.600000,7.600000,4.400000,1.300000

In [16]:
df.describe(include="all")

,Age,Gender,TB,DB,Alkphos,Sgpt,Sgot,TP,ALB,ALB.1,AG,LiverPatient
count,9.000000,7,8.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,7.000000,9
unique,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2
top,NaN,Male,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Yes
freq,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8
mean,48.555556,NaN,3.425000,1.511111,279.888889,28.000000,35.666667,7.122222,7.122222,3.466667,0.932857,NaN
std,19.887880,NaN,3.776147,1.980811,186.536487,19.742087,32.019525,0.334581,0.334581,0.565685,0.304998,NaN
min,17.000000,NaN,0.700000,0.100000,154.000000,14.000000,11.000000,6.700000,6.700000,2.400000,0.400000,NaN
25%,29.000000,NaN,0.900000,0.300000,187.000000,16.000000,14.000000,6.800000,6.800000,3.300000,0.815000,NaN
50%,58.000000,NaN,1.400000,0.400000,202.000000,19.000000,19.000000,7.000000,7.000000,3.400000,0.900000,NaN
75%,62.000000,NaN,4.750000,2.000000,208.000000,27.000000,59.000000,7.400000,7.400000,3.600000,1.150000,NaN
max,72.000000,NaN,10.900000,5.500000,699.000000,64.000000,100.000000,7.600000,7.600000,4.400000,1.300000,NaN

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Age           9 non-null      int64
 1   Gender        7 non-null      object
 2   TB            8 non-null      float64
 3   DB            9 non-null      float64
 4   Alkphos       9 non-null      int64
 5   Sgpt          9 non-null      int64
 6   Sgot          9 non-null      int64
 7   TP            9 non-null      float64
 8   ALB           9 non-null      float64
 9   ALB.1         9 non-null      float64
 10  AG            7 non-null      float64
 11  LiverPatient  9 non-null      object
dtypes: float64(6), int64(4), object(2)
memory usage: 992.0+ bytes

In [18]:
Q1=df["Age"].quantile(0.25)

In [19]:
Q1

29.0

In [21]:
Q3=df["Age"].quantile(0.75)
Q3

62.0

In [22]:
#IQR=Q3-Q1
IQR=Q3-Q1

In [26]:
IQR

33.0

In [28]:
def range(data):
    min_val=min(data)
    max_val=max(data)
    return (max_val-min_val)

#Function call
range(df["Age"])

55

In [30]:
df["Age"].quantile(0.1)   # percetage

24.2

## skewness=0, then it is called as perfect normal distribution
## skewness value lies between -1 to +1 normal distribution
## skewness <-1, then it is left skewed
## skewness >+1, then it is right skewed

In [31]:
df["Age"].skew()

-0.5589146760326897

In [32]:
df["Age"].kurt()

-1.4121595356826657